{"Library": [
    {
        "Dietary restrictions": ["gluten-free"],
        "Steps": [
            "Preheat the oven to 350 degrees F (175 degrees C).",
            "Heat a large skillet over medium-high heat. Add ground beef, onion, and garlic; cook and stir in the hot skillet until beef is browned and crumbly, 5 to 7 minutes. Drain and discard grease. Add mushrooms, oregano, hot sauce, salt, and pepper; simmer for 5 minutes.",
            "Add spinach, condensed soup, and sour cream; cook until heated through, about 5 minutes. Transfer mixture to a casserole dish and cover with mozzarella cheese.",
            "Bake in the preheated oven until cheese is melted, 15 to 20 minutes."
        ],
        "Ingredients": [
            {
                "name": "ground beef",
                "category": "MEAT"
            },
            {
                "name": "onion",
                "category": "NONE"
            },
            {
                "name": "garlic",
                "category": "NONE"
            },
            {
                "name": "mushrooms",
                "category": "NONE"
            },
            {
                "name": "oregano",
                "category": "NONE"
            },
            {
                "name": "spinach",
                "category": "NONE"
            },
            {
                "name": "cream of celery soup",
                "category": "NONE"
            },
            {
                "name": "sour cream",
                "category": "LACTOSE"
            },
            {
                "name": "mozzarella cheese",
                "category": "LACTOSE"
            }
        ],
        "Author": "JNAMCD @ allrecipes.com",
        "Time": 40,
        "Tag": "DEFAULT",
        "ID": 1,
        "Name": "Ground Beef Spinach Casserole"
    },
    {
        "Dietary restrictions": [],
        "Steps": [
            "Preheat the oven to 375 degrees F (190 degrees C).",
            "Heat a large skillet over medium-high heat. Cook and stir ground beef and onion in the hot skillet until beef is browned and crumbly, 5 to 7 minutes. Drain and discard grease.",
            "While the beef is cooking, make stuffing. Bring water and butter to a boil in a medium saucepan. Stir in stuffing mix; cover. Remove from heat. Let stand for 5 minutes. Fluff with a fork.",
            "Stir both cans of diced tomatoes, chili powder, cumin, and hot sauce into the beef mixture. Simmer for 2 minutes. Add corn and Cheddar cheese. Simmer until cheese is melted completely, about 1 minute. Transfer mixture to a casserole dish. Spread cornbread stuffing evenly over the top.",
            "Bake in the preheated oven until browned, 20 to 30 minutes."
        ],
        "Ingredients": [
            {
                "name": "ground beef",
                "category": "MEAT"
            },
            {
                "name": "onion",
                "category": "NONE"
            },
            {
                "name": "salted butter",
                "category": "LACTOSE"
            },
            {
                "name": "cornbread stuffing mix",
                "category": "GLUTEN"
            },
            {
                "name": "tomato",
                "category": "NONE"
            },
            {
                "name": "jalapeno",
                "category": "NONE"
            },
            {
                "name": "green chile peppers",
                "category": "NONE"
            },
            {
                "name": "ground cumin",
                "category": "NONE"
            },
            {
                "name": "sweet corn",
                "category": "NONE"
            },
            {
                "name": "cheddar cheese",
                "category": "LACTOSE"
            }
        ],
        "Author": "AndreaF @ allrecipes.com",
        "Time": 55,
        "Tag": "DEFAULT",
        "ID": 2,
        "Name": "Mexican Ground Beef Casserole"
    },
    {
        "Dietary restrictions": [],
        "Steps": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease a 10-inch pie plate or springform pan.",
            "Bring a large pot of water to a boil. Stir in 1 tablespoon oil and 2 teaspoons salt. Cook spaghetti in boiling water-oil mixture, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain, then transfer to a large bowl.",
            "Mix eggs, Parmesan cheese, and butter into spaghetti until well combined. Press and shape into the prepared pie plate to form crust. Spread cottage cheese over crust.",
            "Heat 1 tablespoon oil in a large skillet over medium-high heat. Cook and stir beef, onion, and green pepper until beef is thoroughly browned and crumbly, 5 to 7 minutes. Mix in tomatoes, tomato paste, sugar, oregano, 1/2 teaspoon salt, and garlic powder until combined. Spread mixture over cottage cheese.",
            "Bake uncovered in the preheated oven for 30 minutes. Sprinkle with mozzarella cheese and continue baking until cheese is bubbly and beginning to brown, 5 to 10 minutes more."
        ],
        "Ingredients": [
            {
                "name": "vegetable oil",
                "category": "NONE"
            },
            {
                "name": "spaghetti",
                "category": "GLUTEN"
            },
            {
                "name": "eggs",
                "category": "NONE"
            },
            {
                "name": "parmesan cheese",
                "category": "LACTOSE"
            },
            {
                "name": "butter",
                "category": "LACTOSE"
            },
            {
                "name": "ground beef",
                "category": "MEAT"
            },
            {
                "name": "onion",
                "category": "NONE"
            },
            {
                "name": "bell pepper",
                "category": "NONE"
            },
            {
                "name": "tomato",
                "category": "NONE"
            },
            {
                "name": "mozzarella cheese",
                "category": "LACTOSE"
            }
        ],
        "Author": "Kimberley @ allrecipes.com",
        "Time": 85,
        "Tag": "DEFAULT",
        "ID": 3,
        "Name": "Spaghetti Pie"
    },
    {
        "Dietary restrictions": [],
        "Steps": [
            "Toss chicken pieces, black pepper, salt, paprika, white pepper, rosemary, thyme, oregano, sage, and cayenne together in a large bowl.",
            "Stir in buttermilk until chicken is evenly coated. Cover and refrigerate for 6 hours.",
            "Combine flour, salt, paprika, cayenne, garlic powder, white pepper, and onion powder in a large shallow dish.",
            "Remove chicken from buttermilk and dredge each piece in seasoned flour; shake off any excess and transfer to a plate.",
            "Heat peanut oil in a large Dutch oven to 350 degrees F (175 degrees C).",
            "Add chicken pieces to the hot oil and fry for 10 minutes. Turn chicken pieces and fry for another 10 to 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
            "Transfer fried chicken to a cooling rack set over a paper towel-lined baking sheet. Let sit for 10 minutes before serving."
        ],
        "Ingredients": [
            {
                "name": "chicken",
                "category": "MEAT"
            },
            {
                "name": "buttermilk",
                "category": "LACTOSE"
            },
            {
                "name": "flour",
                "category": "GLUTEN"
            },
            {
                "name": "peanut oil",
                "category": "NONE"
            }
        ],
        "Author": "Chef John @ allrecipes.com",
        "Time": 410,
        "Tag": "DEFAULT",
        "ID": 4,
        "Name": "Chef John's Buttermilk Fried Chicken"
    },
    {
        "Dietary restrictions": ["lactose-free"],
        "Steps": [
            "Preheat the oven to 325 degrees F (165 degrees C). Line a baking dish with lightly greased foil.",
            "Place carrot, celery, onion, bell pepper, mushrooms, and garlic in a food processor; pulse until very finely chopped, almost to a purée. Transfer to a large mixing bowl.",
            "Add ground chuck to the vegetables, along with Worcestershire sauce, egg, Italian herbs, salt, black pepper, and cayenne. Mix gently with a wooden spoon until ingredients are just combined. Sprinkle in bread crumbs and gently mix with your fingertips until just combined; don't overmix.",
            "Shape the mixture into a loaf, about 4 inches high by 6 inches across. Place in the prepared baking pan.",
            "Bake in the preheated oven just until the meatloaf is hot, about 15 minutes.",
            "Meanwhile, stir brown sugar, ketchup, Dijon, and Sriracha for glaze in a small bowl until brown sugar has dissolved.",
            "Remove meatloaf from the oven. Spoon glaze on the top of the meatloaf with the back of a spoon, then pull a tiny bit glaze down the sides.",
            "Return to the oven, and bake until no longer pink inside, 45 to 75 more minutes. An instant-read thermometer inserted into the thickest part of the loaf should read at least 160 degrees F (70 degrees C), so start checking at 45 minutes and continue baking until meatloaf reaches that temperature. Cooking time will depend on shape and thickness of the meatloaf.",
            "Serve hot and enjoy!"
        ],
        "Ingredients": [
            {
                "name": "carrot",
                "category": "NONE"
            },
            {
                "name": "celery",
                "category": "NONE"
            },
            {
                "name": "onion",
                "category": "NONE"
            },
            {
                "name": "bell pepper",
                "category": "NONE"
            },
            {
                "name": "mushroom",
                "category": "NONE"
            },
            {
                "name": "garlic",
                "category": "NONE"
            },
            {
                "name": "ground chuck",
                "category": "MEAT"
            },
            {
                "name": "worcestershire sauce",
                "category": "NONE"
            },
            {
                "name": "egg",
                "category": "NONE"
            },
            {
                "name": "bread crumbs",
                "category": "GLUTEN"
            }
        ],
        "Author": "Chef John @ allrecipes.com",
        "Time": 90,
        "Tag": "DEFAULT",
        "ID": 5,
        "Name": "Classic Meatloaf"
    },
    {
        "Dietary restrictions": ["vegetarian"],
        "Steps": [
            "Pour water and chicken broth into a saucepan; stir in the garlic and bring to a boil. Stir in pearl couscous, cover the pan, and remove from heat. Allow couscous to stand until water has been absorbed, about 5 minutes; fluff with a fork. Allow couscous to cool to warm temperature.",
            "Lightly toss couscous, chickpeas, sun-dried tomatoes, olives, and feta cheese in a large serving bowl.",
            "To make the dressing: Mix white wine vinegar, lemon juice, oregano, and black pepper in a small bowl until well combined. Pour over couscous mixture; toss again to serve."
        ],
        "Ingredients": [
            {
                "name": "mushroom broth",
                "category": "NONE"
            },
            {
                "name": "garlic",
                "category": "NONE"
            },
            {
                "name": "couscous",
                "category": "GLUTEN"
            },
            {
                "name": "chickpea",
                "category": "NONE"
            },
            {
                "name": "tomato",
                "category": "NONE"
            },
            {
                "name": "olive",
                "category": "NONE"
            },
            {
                "name": "feta cheese",
                "category": "LACTOSE"
            },
            {
                "name": "white wine vinegar",
                "category": "NONE"
            }
        ],
        "Author": "KenzieKook @ allrecipes.com",
        "Time": 45,
        "Tag": "DEFAULT",
        "ID": 6,
        "Name": "Greek Couscous Salad"
    },
    {
        "Dietary restrictions": [],
        "Steps": [
            "Toast your bread to the level you want it to be.",
            "Spread butter on one side of each slice.",
            "Add a slice of cheese, 1 or 2 slices of ham, and a few slices of tomato.",
            "Put in the microwave for ~30 seconds."
        ],
        "Ingredients": [
            {
                "name": "ham",
                "category": "MEAT"
            },
            {
                "name": "cheese",
                "category": "LACTOSE"
            },
            {
                "name": "butter",
                "category": "LACTOSE"
            },
            {
                "name": "bread",
                "category": "GLUTEN"
            },
            {
                "name": "tomato",
                "category": "NONE"
            }
        ],
        "Author": "Vi",
        "Time": 15,
        "Tag": "DEFAULT",
        "ID": 7,
        "Name": "Vi's breakfast toast"
    },
    {
        "Dietary restrictions": ["gluten-free"],
        "Steps": [
            "Test step 1",
            "Test step 2",
            "Test step 3"
        ],
        "Ingredients": [
            {
                "name": "broccoli",
                "category": "NONE"
            },
            {
                "name": "beef",
                "category": "MEAT"
            },
            {
                "name": "cucumber",
                "category": "NONE"
            },
            {
                "name": "fish",
                "category": "MEAT"
            },
            {
                "name": "milk",
                "category": "LACTOSE"
            }
        ],
        "Author": "Meomeow",
        "Time": 37,
        "Tag": "DRAFT",
        "ID": 8,
        "Name": "CatCatCat"
    },
    {
        "Dietary restrictions": [
            "lactose-free",
            "gluten-free",
            "vegetarian"
        ],
        "Steps": [
            "Mix one teaspoon of dark ground coffee and one teaspoon of honey with hot water, stir well",
            "Heat up a cup of oatmilk, you can use the microwave if you want",
            "Mix everything together, stir and enjoy!"
        ],
        "Ingredients": [
            {
                "name": "oatmilk",
                "category": "NONE"
            },
            {
                "name": "dark ground coffee",
                "category": "NONE"
            },
            {
                "name": "honey",
                "category": "NONE"
            }
        ],
        "Author": "Vi",
        "Time": 18,
        "Tag": "DEFAULT",
        "ID": 9,
        "Name": "Oatmilk latte"
    },
    {
        "Dietary restrictions": [
            "lactose-free",
            "gluten-free"
        ],
        "Steps": [
            "Heat up the pan to the highest. When the pan is slightly hot, put a tablespoon-ish of oil in.",
            "When the oil is slightly hot (don't check with your hand), put minced garlic and minced onion in, stir fry well.",
            "Put chopped tomato in, stir fry until slightly soft, add 1/4 cup of water, close the lid. Reduce heat to medium, wait for around 5 minutes.",
            "Meanwhile, mix egg with 1 tablespoon of fish sauce. After the tomato are soft, put egg in and scramble continuously.",
            "Turn off the heat when the egg seems done and enjoy!"
        ],
        "Ingredients": [
            {
                "name": "egg",
                "category": "NONE"
            },
            {
                "name": "tomato",
                "category": "NONE"
            },
            {
                "name": "vegetarian oil",
                "category": "NONE"
            },
            {
                "name": "onion",
                "category": "NONE"
            },
            {
                "name": "fish sauce",
                "category": "MEAT"
            },
            {
                "name": "garlic",
                "category": "NONE"
            }
        ],
        "Author": "Vi",
        "Time": 21,
        "Tag": "DEFAULT",
        "ID": 10,
        "Name": "Scrambled eggs with tomato"
    },
    {
        "Dietary restrictions": [
            "lactose-free",
            "gluten-free",
            "vegetarian"
        ],
        "Steps": [
            "test step 1",
            "test step 2"
        ],
        "Ingredients": [
            {
                "name": "cabbage",
                "category": "NONE"
            },
            {
                "name": "cucumber",
                "category": "NONE"
            }
        ],
        "Author": "Anonymous",
        "Time": 15,
        "Tag": "DRAFT",
        "ID": 11,
        "Name": "hehe"
    }
]}